const style = {
    marginLeft: 'auto',
    marginRight: 'auto',
    marginTop: '50px',
    width: '70%',
    fontSize: window.innerWidth > 800 ? '20px' : '15px'
}

function PolicyPage() {
    window.scrollTo(0, 0);
    return <div className="flex-container column" style={style}>
        <h2>Політика конфіденційності</h2>
        <p>
        Сервіс доставки ціKava турбується про забезпечення безпеки 
        даних свої клієнтів. Саме тому ми склали цю Політику конфіденційності, 
        щоб ви не турбувалися про те, що відбувається з вашими персональними даними, 
        які ви надали нам для реєстрації. Реєструючись на веб-сайті, ви надаєте {" "} 
        <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "}
        згоду на обробку усіх введених для реєстрації даних з метою належного надання послуг 
        доставки піци, як це передбачено Публічною офертою. Реєструючись на веб-сайті, 
        ви також підтверджуєте, що ознайомилися з переліком своїх прав як суб'єкта даних згідно 
        зі статтею 8 Закону України «Про захист персональних даних». Цей перелік доступний за 
        посиланням: {" "} 
        <a href="http://zakon2.rada.gov.ua/laws/show/2297-17." target='_blank'>http://zakon2.rada.gov.ua/laws/show/2297-17.</a>
        </p>
        <h4>1. ЗБІР ОСОБИСТОЇ ІНФОРМАЦІЇ</h4>
        <p>
        1.1. Під час реєстрації на сайті ми просимо вас повідомити необхідну особисту інформацію в обсязі, 
        який є необхідним для надання послуг. Ми залишаємо за собою право вимагати надати додаткову особисту 
        інформацію в разі потреби.
        </p>
        <p>
        1.2. Файли cookie - коли ви заходите на наш сайт, ми відправляємо один або декілька файлів cookie на 
        ваш комп'ютер або інший пристрій. Файли cookie використовуються для того, щоб підвищувати якість послуг,
         що надаються: зберігати налаштування користувача.
        </p>
        <p>
        1.3. Інформація про відвідання - при доступі на сайт наші сервери автоматично записують певну 
        інформацію. Ці журнали сервера можуть містити таку інформацію, як веб-запит, IP-адресу, 
        тип та мову браузера, дату та час запиту.
        </p>
        <p>
        1.4. Продаж послуг на партнерських сайтах - деякі послуги, що ми пропонуємо, пов'язані з 
        іншими сайтами. Особиста інформація, яку ви надаєте таким сайтам, може бути передана нам для 
        надання цих послуг. Ми обробляємо інформацію такого роду у відповідності з цією політикою конфіденційності.
        </p>
        <p>
        1.5. <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "} 
        може обробляти особисту інформацію на серверах в Україні та в інших країнах. 
        У деяких випадках особиста інформація користувачів обробляється за межами країни користувача.
        </p>
        <h4>2. НАДАННЯ ДОСТУПУ ДО ІНФОРМАЦІЇ</h4>
        <p>2.1. Ми надаємо доступ до вашої особистої інформації іншим особам лише за таких 
            обмежених обставин:</p>
        <p>2.1.1. У нас є на це ваш дозвіл. Для передачі будь-якої конфіденційної інформації 
            нам потрібна ваша явна згода.</p>
        <p>
        2.1.2. Відповідно до вимог реєстрів доменних імен інформація про власника домену має бути 
        опублікована в системі Whois. У зв'язку з цим, ваше прізвище, ім'я, по батькові, адреса, 
        поштовий індекс, телефон, e-mail адреса публікуються у відкритих джерелах, до яких має доступ 
        будь-який користувач Інтернет.
        </p>
        <p>
        2.1.3. У нас є достатні підстави вважати, що доступ, використання, збереження або розкриття 
        такої інформації необхідні для:
        </p>
        <p>2.1.3.1. дотримання законодавства України, у тому числі надання інформації на вимогу 
            фізичних та юридичних осіб, установ, організацій будь-якої форми власності або державних 
            органів, які мають право на отримання такої інформації згідно із законодавством України;</p>
        <h4>3. ЗАХИСТ ІНФОРМАЦІЇ</h4>
        <p>3.1. Ми вживаємо всіх необхідних заходів для захисту даних від несанкціонованого доступу, 
            зміни, розкриття або знищення. До цих заходів належать, зокрема, внутрішня перевірка процесів збору, 
            зберігання і обробки даних та заходів безпеки, включаючи відповідне шифрування та заходи щодо 
            забезпечення фізичної безпеки даних для запобігання неавторизованого доступу</p>
        <h4>4. ДОСТУП ДО ОСОБИСТОЇ ІНФОРМАЦІЇ ТА ЇЇ ОНОВЛЕННЯ</h4>
        <p>
        4.1. Ми робимо все, що від нас залежить, щоб надати вам доступ до ваших особистих даних і або 
        виправити їх, якщо вони невірні, чи вилучити за вашим запитом, якщо тільки їх зберігання не
         вимагається законом або не обумовлено законними діловими цілями. Перед обробкою запитів ми 
         просимо користувачів підтвердити свою особу та інформацію, яку вони хочуть отримати, виправити 
         або видалити.
        </p>
        <h4>5. ЗМІНА ЦІЄЇ ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ</h4>
        <p>5.1. Ця політика конфіденційності може час від часу змінюватися. Зміни, що вносяться в політику 
            конфіденційності, будуть публікувати на цій сторінці.</p>
    </div>
}

module.exports = PolicyPage;