const style = {
    marginLeft: 'auto',
    marginRight: 'auto',
    marginTop: '50px',
    width: '70%',
    fontSize: window.innerWidth > 800 ? '20px' : '15px'
}

function PublicPage() {
    window.scrollTo(0, 0);
    return (
        <div className="flex-container column" style={style}>
            <h2>Договір публічної оферти</h2>
            <p>
            За цим Договором одна сторона Продавець, з одного боку, і будь-яка особа, 
            яка прийняла умови даного Договору публічної оферти – Покупець, з іншого боку, 
            далі разом – Сторони, уклали даний Договір публічної оферти (далі — Договір), 
            адресований необмеженому колу осіб, який є офіційною публічною пропозицією 
            Продавця укласти з Покупцями договір купівлі-продажу Товарів, фотографії яких 
            розміщені у відповідному розділі Веб-сайту {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> .
            <br /><br />
            Продавці, що мають намір здійснювати продаж Товарів за допомогою Веб-сайту 
            {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "}
            та Покупці при придбанні Товарів, зображення яких розміщені 
            на відповідних сторінках Веб-сайту {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> , 
            приймають умови цього Договору про нижченаведене.
            </p>
            <h4>1. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h4>
            <p>
            1.1. Договірні відносини між Продавцем і Покупцем оформляються у вигляді 
            Договору публічної оферти. Натискання на сторінці Веб-сайту {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> у 
            відповідному розділі кнопки "ЗАМОВИТИ", означає, що Покупець, незалежно від статусу 
            (фізична особа, юридична особа, фізична особа — підприємець), згідно чинного міжнародного 
            та українського законодавства, взяв до виконання умови Договору публічної оферти, які вказані
            нижче.
            </p>
            <p>
            1.2. Договір публічної оферти є публічним, тобто відповідно до статей 633, 641 
            Цивільного кодексу України його умови однакові для всіх Покупців незалежно від статусу 
            (фізична особа, юридична особа, фізична особа — підприємець). При повній згоді з даним 
            Договором Покупець приймає умови та порядок оформлення замовлення, оплати та доставки товару 
            Продавцем, відповідальності за недобросовісне Замовлення і за невиконання умов цього Договору.
            </p>
            <h4>2. ТЕРМІНИ І ВИЗНАЧЕННЯ</h4>
            <p>
            «Договір публічної оферти» – публічний договір, зразок якого розміщений на Веб-сайті 
            {" "} <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> , 
            і застосування якого є обов'язковим для всіх Продавців, що містить пропозицію Продавця 
            щодо придбання Товару, зображення якого розміщено на Веб-сайті {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> , 
            спрямовану невизначеному колу осіб, у тому числі Покупцям.
            </p>
            <p>«Акцепт» – прийняття Покупцем пропозиції Продавця щодо придбання Товару, 
            зображення якого розміщено на Веб-сайті {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> , 
            шляхом додавання його у віртуальний кошик та відправлення Замовлення.
            </p>
            <p>
            «Товар» – предмет торгівлі (виріб, модель, аксесуар, комплектуючі та супровідні предмети, 
            будь-які інші предмети торгівлі), щодо придбання якого на Веб-сайті {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "} 
            розміщена пропозиція Продавця.
            </p>
            <p>
            «Покупець» – будь-яка дієздатна фізична, юридична особа, фізична особа-підприємець, 
            згідно чинного українського законодавства, що відвідали Веб-сайт {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "} 
            та мають намір придбати той чи інший Товар.
            </p>
            <p>
            «Продавець» – будь-яка дієздатна фізична, юридична особа, фізична особа-підприємець, 
            згідно чинного міжнародного та українського законодавства, які є власниками чи розповсюджувачами 
            Товару та за допомогою Веб-сайту {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "} 
            мають намір його продати.
            </p>
            <p>
            «Замовлення» – належно оформлена та розміщена на Веб-сайті {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "}  
            заявка Покупця на купівлю Товарів, що адресується Продавцю
            </p>
            <h4>3. ПРЕДМЕТ ДОГОВОРУ</h4>
            <p>
            3.1. Продавець зобов'язується на умовах та в порядку, визначених цим Договором, 
            продати Товар на основі Замовлення, оформленого Покупцем на відповідній сторінці Веб-сайту {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "}, 
            а Покупець зобов'язується на умовах та в порядку, визначених цим Договором, 
            придбати Товар і сплатити за нього кошти.
            </p>
            <p>
            3.2. Продавець гарантує, що Товар не переданий в заставу, не є предметом спору, 
            не перебуває під арештом, а також на нього відсутні будь-які права третіх осіб.
            </p>
            <h4>4. ПОРЯДОК ОФОРМЛЕННЯ ЗАМОВЛЕННЯ</h4>
            <p>
            4.1. Покупець самостійно оформлює Замовлення на відповідній сторінці Веб-сайту {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "} 
            шляхом додавання Товарів у віртуальний кошик за допомогою 
            натискання кнопки "У кошик!", або зробивши замовлення по електронній пошті, 
            чи за номером телефону, вказаному в розділі контактів Веб-сайту {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "}.
            </p>
            <h4>5. ЦІНА ДОГОВОРУ І ПОРЯДОК ОПЛАТИ</h4>
            <p>
            5.1. Ціна кожного окремого Товару визначається Продавцем та зазначається на 
            відповідній сторінці Веб-сайту {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "}. 
            Ціна Договору визначається шляхом додавання цін всіх обраних Товарів поміщених у 
            віртуальний кошик та ціни доставки, яка визначається в залежності від способу 
            доставки відповідно до умов розділу 8 цього Договору.
            </p>
            <p>5.2. Покупець може оплатити Замовлення наступними способами:</p>
            <ol>
                <li> за допомогою банківського переказу грошей на поточний рахунок Продавця, 
                    що вказаний в рахунку, в т.ч. за допомогою Інтернет-банкінгу.</li>
                <li>Кредитною карткою наступного типу: Visa, Visa Electron, Mastercard, Mastercard Electronic</li>
                <li>будь-яким іншим способом за домовленістю з Продавцем.</li>
            </ol>
            <h4>6 ПРАВА ТА ОБОВ'ЯЗКИ СТОРІН</h4>
            <p>
            6.1. За даним Договором Продавець бере на себе зобов'язання продати Товари, 
            запропоновані до продажу на Сайті відповідно до оформленого належним чином 
            Замовлення Покупця та умов даної оферти, а Покупець зобов'язується прийняти 
            та оплатити замовлені ним Товари
            </p>
            <p>
            6.2. Даний Договір поширюється на всі Товари, продемонстровані на Сайті на 
            момент здійснення Замовлення Покупцем.
            </p>
            <p>
            6.3. Продавець зобов'язується:
            </p>
            <ul>
                <li>продавати Товари, передбачені умовами даного Договору;</li>
                <li>забезпечити можливість замовлення та оплати Товарів;</li>
                <li>надавати консультації з питань користування Сайтом та оформлення Замовлення;</li>
            </ul>
            <p>
            6.4. Продавець має право:
            </p>
            <ul>
                <li>відмовити у продажі та/або передачі замовлених Товарів 
                    у зв'язку з неналежним виконанням Покупцем своїх зобов'язань 
                    відповідно до даного Договору;</li>
                <li>вносити зміни до даного Договору в односторонньому порядку;</li>
                <li>вносити зміни щодо інформації, розміщеної на Сайті в односторонньому порядку та 
                    на власний розсуд;</li>
                <li>залучати третіх осіб для виконання своїх зобов'язань перед Покупцем;</li>
                <li>змінювати умови та/або термін доставки Товарів Покупцю за умови повідомлення 
                    Покупця про такі зміни за вказаним ним при здійсненні замовлення номером телефону;</li>
            </ul>
            <p>6.5. Покупець зобов'язується:</p>
            <ul>
                <li>дотримуватись умов даного Договору;</li>
                <li>прийняти Товар належної якості, який відповідає замовленню Покупця;</li>
                <li>оплатити Товар до його отримання або в момент його отримання;</li>
                <li>перевірити кількість та найменування замовлених Товарів при їх отриманні.</li>
            </ul>
            <p>6.6. Покупець має право: – вимагати від Продавця продажу Товарів у 
                відповідності до умов даного Договору.</p>
            <h4>7 УМОВИ ПОВЕРНЕННЯ ТОВАРУ</h4>
            <p>
            7.1. Відповідно до ст. 9 Закону України «Про захист прав споживачів», 
            Покупець має право на обмін Товару належної якості протягом чотирнадцяти днів, 
            не рахуючи дня купівлі, якщо триваліший строк не оголошений Продавцем. 
            Покупець має право на обмін Товару із врахуванням положень законодавства про 
            підстави та перелік Товарів, що не підлягають обміну (поверненню).  
            </p>
            <p>
            7.2. Якщо Покупець має намір повернути Товар, таке повернення здійснюється 
            відповідно до розділу Сайту «Повернення» з урахуванням правил та умов перевізника 
            або кур'єра, які діють на території України чи на території іншої країни відповідно 
            до місця здійснення отримання Товару.
            </p>
            <h4>8 ВІДПОВІДАЛЬНІСТЬ СТОРІН ТА ВИРІШЕННЯ СПОРІВ</h4>
            <p>8.1. Сторони відповідають за невиконання або неналежне виконання умов цього 
                Договору в порядку, передбаченому цим Договором і, чинним міжнародним та 
                українським законодавством.</p>
            <p>
            8.2. У разі виникнення спорів, пов'язаних з виконанням Сторонами цього Договору, 
            за винятком спорів щодо стягнення заборгованості з Покупця, Сторони зобов'язуються 
            вирішувати їх шляхом переговорів з дотриманням претензійного порядку. Термін розгляду 
            претензії — 7 (сім) календарних днів від дати її отримання. По спорах у зв'язку із 
            стягненням заборгованості з Покупця дотримання претензійного порядку не потрібно.
            </p>
            <h4>9 ІНШІ УМОВИ ДОГОВОРУ</h4>
            <p>
            9.1. Інформація, що надається Покупцем є конфіденційною. Інформація про Покупця 
            використовується виключно в цілях виконання його Замовлення 
            (відправлення повідомлення Продавцю про замовлення Товару, 
            надсилання рекламних повідомлень і т.д.).
            </p>
            <p>
            9.2. Власним акцептування Договору або реєстрацією на Веб-сайті {" "} 
            <a href="https://tsikava.com.ua" target='_blank'>https://tsikava.com.ua</a> {" "} 
            (заповнення реєстраційної анкети) Покупець добровільно надає згоду на збір та 
            обробку власних персональних даних
            </p>
        </div>
    )
}

module.exports = PublicPage;